node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "ffffff\026@ffffff\n@\000\000\000\000\000\000\022@\000\000\000\000\000\000\370?333333\373?\315\314\314\314\314\314\364?\000\000\000\000\000\000\370?ffffff\024@\232\231\231\231\231\231\021@\000\000\000\000\000\000\370?333333\017@\232\231\231\231\231\231\023@333333\363?333333\373?\315\314\314\314\314\314\032@\315\314\314\314\314\314\022@\232\231\231\231\231\231\027@ffffff\032@333333\025@\000\000\000\000\000\000\370?\315\314\314\314\314\314\026@ffffff\026@\315\314\314\314\314\314\364?ffffff\026@333333\027@\000\000\000\000\000\000\370?\000\000\000\000\000\000\020@ffffff\024@\000\000\000\000\000\000\022@\000\000\000\000\000\000\024@\232\231\231\231\231\231\021@\000\000\000\000\000\000\010@\000\000\000\000\000\000\022@\000\000\000\000\000\000\026@333333\023@\315\314\314\314\314\314\026@ffffff\024@ffffff\024@\000\000\000\000\000\000\370?ffffff\366?\232\231\231\231\231\231\031@ffffff\024@\315\314\314\314\314\314\024@ffffff\376?\232\231\231\231\231\231\371?\000\000\000\000\000\000\024@\232\231\231\231\231\231\371?\232\231\231\231\231\231\033@\000\000\000\000\000\000\360?\000\000\000\000\000\000\030@ffffff\366?\232\231\231\231\231\231\021@\000\000\000\000\000\000\020@333333\363?\315\314\314\314\314\314\022@333333\023@ffffff\030@ffffff\024@\232\231\231\231\231\231\025@\000\000\000\000\000\000\014@333333\017@ffffff\026@\000\000\000\000\000\000\024@\000\000\000\000\000\000\026@\000\000\000\000\000\000\022@333333\031@\315\314\314\314\314\314\364?ffffff\030@\000\000\000\000\000\000\026@\000\000\000\000\000\000\370?\315\314\314\314\314\314\364?ffffff\022@\315\314\314\314\314\314\364?ffffff\030@\232\231\231\231\231\231\023@\000\000\000\000\000\000\370?ffffff\016@\315\314\314\314\314\314\020@\000\000\000\000\000\000\022@333333\025@\000\000\000\000\000\000\370?\315\314\314\314\314\314\022@ffffff\022@\315\314\314\314\314\314\020@ffffff\026@\000\000\000\000\000\000\370?333333\023@\000\000\000\000\000\000\022@ffffff\024@\315\314\314\314\314\314\364?\315\314\314\314\314\314\024@\315\314\314\314\314\314\022@ffffff\366?\000\000\000\000\000\000\370?333333\027@ffffff\366?ffffff\366?\315\314\314\314\314\314\032@333333\023@\232\231\231\231\231\231\371?ffffff\366?ffffff\n@\315\314\314\314\314\314\364?ffffff\020@\232\231\231\231\231\231\371?ffffff\366?\000\000\000\000\000\000\370?ffffff\366?\315\314\314\314\314\314\014@\232\231\231\231\231\231\371?\232\231\231\231\231\231\023@ffffff\020@\232\231\231\231\231\231\371?\000\000\000\000\000\000\030@\232\231\231\231\231\231\371?\232\231\231\231\231\231\021@\315\314\314\314\314\314\020@ffffff\366?ffffff\366?\232\231\231\231\231\231\r@"
      }
    }
  }
}
node {
  name: "tensors/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "\232\231\231\231\231\231\001@\000\000\000\000\000\000\360?333333\373?\232\231\231\231\231\231\271?333333\323?\232\231\231\231\231\231\311?\232\231\231\231\231\231\331?ffffff\002@ffffff\366?\232\231\231\231\231\231\331?ffffff\366?\000\000\000\000\000\000\370?\232\231\231\231\231\231\311?\232\231\231\231\231\231\331?\232\231\231\231\231\231\001@\232\231\231\231\231\231\371?ffffff\002@\315\314\314\314\314\314\000@ffffff\002@\232\231\231\231\231\231\331?\315\314\314\314\314\314\000@\315\314\314\314\314\314\000@\232\231\231\231\231\231\331?ffffff\366?\232\231\231\231\231\231\371?\232\231\231\231\231\231\311?333333\363?\315\314\314\314\314\314\374?\000\000\000\000\000\000\370?333333\373?\315\314\314\314\314\314\364?\232\231\231\231\231\231\361?\000\000\000\000\000\000\370?\315\314\314\314\314\314\000@\315\314\314\314\314\314\374?ffffff\002@\000\000\000\000\000\000\000@333333\003@333333\323?333333\323?\000\000\000\000\000\000\000@ffffff\376?ffffff\002@\232\231\231\231\231\231\331?\232\231\231\231\231\231\311?\000\000\000\000\000\000\370?\232\231\231\231\231\231\311?ffffff\002@\232\231\231\231\231\231\311?\315\314\314\314\314\314\374?\232\231\231\231\231\231\311?ffffff\366?\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?ffffff\366?\315\314\314\314\314\314\374?ffffff\376?ffffff\376?ffffff\002@\000\000\000\000\000\000\360?\232\231\231\231\231\231\361?333333\003@ffffff\376?\315\314\314\314\314\314\374?\000\000\000\000\000\000\370?\315\314\314\314\314\314\374?\232\231\231\231\231\231\311?\000\000\000\000\000\000\004@\315\314\314\314\314\314\374?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?ffffff\002@\315\314\314\314\314\314\374?\232\231\231\231\231\231\271?\232\231\231\231\231\231\361?\315\314\314\314\314\314\364?\000\000\000\000\000\000\370?ffffff\376?\232\231\231\231\231\231\311?ffffff\366?\000\000\000\000\000\000\370?\315\314\314\314\314\314\364?333333\003@\232\231\231\231\231\231\271?ffffff\366?\315\314\314\314\314\314\364?\232\231\231\231\231\231\371?333333\323?\000\000\000\000\000\000\000@333333\363?333333\323?\232\231\231\231\231\231\311?\232\231\231\231\231\231\001@333333\323?\232\231\231\231\231\231\311?\000\000\000\000\000\000\000@\315\314\314\314\314\314\374?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\000\000\000\000\000\000\360?333333\323?\000\000\000\000\000\000\360?\232\231\231\231\231\231\331?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?\315\314\314\314\314\314\374?\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?\000\000\000\000\000\000\004@333333\343?333333\363?333333\363?\232\231\231\231\231\231\311?\232\231\231\231\231\231\271?\000\000\000\000\000\000\360?"
      }
    }
  }
}
node {
  name: "tensors/component_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "\232\231\231\231\231\231\031@\000\000\000\000\000\000\024@\232\231\231\231\231\231\023@\232\231\231\231\231\231\023@\315\314\314\314\314\314\026@\232\231\231\231\231\231\021@\232\231\231\231\231\231\025@\232\231\231\231\231\231\033@\315\314\314\314\314\314\032@ffffff\024@\315\314\314\314\314\314\024@\232\231\231\231\231\231\033@333333\027@\232\231\231\231\231\231\025@\315\314\314\314\314\314\036@333333\031@333333\033@ffffff\036@\232\231\231\231\231\231\031@\315\314\314\314\314\314\026@\315\314\314\314\314\314\032@\232\231\231\231\231\231\031@\232\231\231\231\231\231\025@ffffff\030@\315\314\314\314\314\314\034@\315\314\314\314\314\314\024@333333\027@\232\231\231\231\231\231\027@\232\231\231\231\231\231\025@\315\314\314\314\314\314\032@333333\031@ffffff\024@\232\231\231\231\231\231\031@333333\033@\315\314\314\314\314\314\030@\232\231\231\231\231\231\033@\000\000\000\000\000\000\032@333333\027@ffffff\024@333333\023@\232\231\231\231\231\231\037@333333\027@\315\314\314\314\314\314\032@ffffff\024@\315\314\314\314\314\314\022@\000\000\000\000\000\000\030@333333\023@\315\314\314\314\314\314\036@ffffff\022@\315\314\314\314\314\314\034@\000\000\000\000\000\000\024@ffffff\032@ffffff\030@\000\000\000\000\000\000\024@\000\000\000\000\000\000\034@\000\000\000\000\000\000\030@\232\231\231\231\231\231\035@333333\027@\315\314\314\314\314\314\030@\000\000\000\000\000\000\024@ffffff\026@\315\314\314\314\314\314\032@333333\031@\232\231\231\231\231\231\031@\315\314\314\314\314\314\030@333333\035@\232\231\231\231\231\231\021@\315\314\314\314\314\314\034@\000\000\000\000\000\000\032@\000\000\000\000\000\000\024@\315\314\314\314\314\314\022@ffffff\032@\000\000\000\000\000\000\026@\315\314\314\314\314\314\036@ffffff\030@\232\231\231\231\231\231\023@\000\000\000\000\000\000\026@\315\314\314\314\314\314\026@\000\000\000\000\000\000\030@\232\231\231\231\231\231\031@\232\231\231\231\231\231\025@ffffff\030@\000\000\000\000\000\000\032@ffffff\026@333333\031@\232\231\231\231\231\231\023@333333\033@\315\314\314\314\314\314\026@\000\000\000\000\000\000\030@\000\000\000\000\000\000\024@\000\000\000\000\000\000\032@ffffff\030@ffffff\024@ffffff\022@\000\000\000\000\000\000\032@ffffff\022@ffffff\022@\315\314\314\314\314\314\036@\232\231\231\231\231\231\027@ffffff\024@\232\231\231\231\231\231\023@\232\231\231\231\231\231\023@\000\000\000\000\000\000\022@333333\027@\000\000\000\000\000\000\024@\315\314\314\314\314\314\024@333333\025@\000\000\000\000\000\000\024@ffffff\026@333333\023@333333\031@\315\314\314\314\314\314\026@\000\000\000\000\000\000\024@333333\031@\000\000\000\000\000\000\024@\000\000\000\000\000\000\026@\315\314\314\314\314\314\026@\232\231\231\231\231\231\021@333333\023@\000\000\000\000\000\000\026@"
      }
    }
  }
}
node {
  name: "tensors/component_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "ffffff\006@ffffff\002@\000\000\000\000\000\000\004@\315\314\314\314\314\314\010@ffffff\016@\232\231\231\231\231\231\t@333333\013@\315\314\314\314\314\314\010@\315\314\314\314\314\314\010@\232\231\231\231\231\231\r@\232\231\231\231\231\231\005@\315\314\314\314\314\314\010@\000\000\000\000\000\000\020@333333\017@ffffff\016@ffffff\n@\232\231\231\231\231\231\t@\000\000\000\000\000\000\010@\232\231\231\231\231\231\t@\232\231\231\231\231\231\021@ffffff\n@ffffff\006@333333\017@\315\314\314\314\314\314\004@\000\000\000\000\000\000\010@\000\000\000\000\000\000\014@\315\314\314\314\314\314\004@\000\000\000\000\000\000\010@\000\000\000\000\000\000\010@\000\000\000\000\000\000\010@ffffff\002@\000\000\000\000\000\000\004@\232\231\231\231\231\231\t@\000\000\000\000\000\000\010@ffffff\006@\232\231\231\231\231\231\t@\232\231\231\231\231\231\t@ffffff\006@ffffff\016@\000\000\000\000\000\000\010@ffffff\016@\232\231\231\231\231\231\005@\000\000\000\000\000\000\010@ffffff\016@\232\231\231\231\231\231\t@\232\231\231\231\231\231\001@333333\013@\315\314\314\314\314\314\004@\315\314\314\314\314\314\014@\232\231\231\231\231\231\t@ffffff\n@\000\000\000\000\000\000\010@ffffff\006@\232\231\231\231\231\231\t@\232\231\231\231\231\231\t@\000\000\000\000\000\000\010@ffffff\006@\232\231\231\231\231\231\005@333333\013@\000\000\000\000\000\000\000@\000\000\000\000\000\000\004@\315\314\314\314\314\314\010@\000\000\000\000\000\000\004@\315\314\314\314\314\314\010@\232\231\231\231\231\231\001@333333\007@\000\000\000\000\000\000\010@\315\314\314\314\314\314\014@\000\000\000\000\000\000\010@333333\013@\232\231\231\231\231\231\t@333333\007@\000\000\000\000\000\000\014@\000\000\000\000\000\000\010@\000\000\000\000\000\000\010@\315\314\314\314\314\314\010@333333\003@333333\007@333333\007@\232\231\231\231\231\231\005@\232\231\231\231\231\231\r@333333\007@ffffff\006@\232\231\231\231\231\231\005@333333\013@\315\314\314\314\314\314\010@ffffff\006@ffffff\006@\232\231\231\231\231\231\005@\000\000\000\000\000\000\014@\000\000\000\000\000\000\010@ffffff\006@\000\000\000\000\000\000\014@\315\314\314\314\314\314\010@\000\000\000\000\000\000\010@333333\013@\232\231\231\231\231\231\t@ffffff\006@\232\231\231\231\231\231\t@ffffff\016@\000\000\000\000\000\000\010@333333\003@ffffff\002@\232\231\231\231\231\231\005@333333\013@333333\013@\232\231\231\231\231\231\r@\315\314\314\314\314\314\014@333333\007@\315\314\314\314\314\314\010@\232\231\231\231\231\231\005@ffffff\006@\000\000\000\000\000\000\010@ffffff\n@\000\000\000\000\000\000\014@\315\314\314\314\314\314\004@\000\000\000\000\000\000\010@333333\007@\000\000\000\000\000\000\010@333333\003@"
      }
    }
  }
}
node {
  name: "tensors/component_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1000
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "OneShotIterator"
  op: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dataset_factory"
    value {
      func {
        name: "_make_dataset_rd5t8AqJ92M"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IteratorGetNext"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
      }
    }
  }
}
node {
  name: "input_layer/PetalLength/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "input_layer/PetalLength/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext"
  input: "input_layer/PetalLength/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/PetalLength/ToFloat"
  op: "Cast"
  input: "input_layer/PetalLength/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/PetalLength/Shape"
  op: "Shape"
  input: "input_layer/PetalLength/ToFloat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "input_layer/PetalLength/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "input_layer/PetalLength/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/PetalLength/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/PetalLength/strided_slice"
  op: "StridedSlice"
  input: "input_layer/PetalLength/Shape"
  input: "input_layer/PetalLength/strided_slice/stack"
  input: "input_layer/PetalLength/strided_slice/stack_1"
  input: "input_layer/PetalLength/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "input_layer/PetalLength/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/PetalLength/Reshape/shape"
  op: "Pack"
  input: "input_layer/PetalLength/strided_slice"
  input: "input_layer/PetalLength/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "input_layer/PetalLength/Reshape"
  op: "Reshape"
  input: "input_layer/PetalLength/ToFloat"
  input: "input_layer/PetalLength/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/PetalWidth/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "input_layer/PetalWidth/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext:1"
  input: "input_layer/PetalWidth/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/PetalWidth/ToFloat"
  op: "Cast"
  input: "input_layer/PetalWidth/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/PetalWidth/Shape"
  op: "Shape"
  input: "input_layer/PetalWidth/ToFloat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "input_layer/PetalWidth/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "input_layer/PetalWidth/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/PetalWidth/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/PetalWidth/strided_slice"
  op: "StridedSlice"
  input: "input_layer/PetalWidth/Shape"
  input: "input_layer/PetalWidth/strided_slice/stack"
  input: "input_layer/PetalWidth/strided_slice/stack_1"
  input: "input_layer/PetalWidth/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "input_layer/PetalWidth/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/PetalWidth/Reshape/shape"
  op: "Pack"
  input: "input_layer/PetalWidth/strided_slice"
  input: "input_layer/PetalWidth/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "input_layer/PetalWidth/Reshape"
  op: "Reshape"
  input: "input_layer/PetalWidth/ToFloat"
  input: "input_layer/PetalWidth/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/SepalLength/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "input_layer/SepalLength/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext:2"
  input: "input_layer/SepalLength/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/SepalLength/ToFloat"
  op: "Cast"
  input: "input_layer/SepalLength/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/SepalLength/Shape"
  op: "Shape"
  input: "input_layer/SepalLength/ToFloat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "input_layer/SepalLength/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "input_layer/SepalLength/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/SepalLength/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/SepalLength/strided_slice"
  op: "StridedSlice"
  input: "input_layer/SepalLength/Shape"
  input: "input_layer/SepalLength/strided_slice/stack"
  input: "input_layer/SepalLength/strided_slice/stack_1"
  input: "input_layer/SepalLength/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "input_layer/SepalLength/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/SepalLength/Reshape/shape"
  op: "Pack"
  input: "input_layer/SepalLength/strided_slice"
  input: "input_layer/SepalLength/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "input_layer/SepalLength/Reshape"
  op: "Reshape"
  input: "input_layer/SepalLength/ToFloat"
  input: "input_layer/SepalLength/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/SepalWidth/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "input_layer/SepalWidth/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext:3"
  input: "input_layer/SepalWidth/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/SepalWidth/ToFloat"
  op: "Cast"
  input: "input_layer/SepalWidth/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/SepalWidth/Shape"
  op: "Shape"
  input: "input_layer/SepalWidth/ToFloat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "input_layer/SepalWidth/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "input_layer/SepalWidth/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/SepalWidth/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/SepalWidth/strided_slice"
  op: "StridedSlice"
  input: "input_layer/SepalWidth/Shape"
  input: "input_layer/SepalWidth/strided_slice/stack"
  input: "input_layer/SepalWidth/strided_slice/stack_1"
  input: "input_layer/SepalWidth/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "input_layer/SepalWidth/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/SepalWidth/Reshape/shape"
  op: "Pack"
  input: "input_layer/SepalWidth/strided_slice"
  input: "input_layer/SepalWidth/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "input_layer/SepalWidth/Reshape"
  op: "Reshape"
  input: "input_layer/SepalWidth/ToFloat"
  input: "input_layer/SepalWidth/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "input_layer/concat/axis"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_layer/concat"
  op: "ConcatV2"
  input: "input_layer/PetalLength/Reshape"
  input: "input_layer/PetalWidth/Reshape"
  input: "input_layer/SepalLength/Reshape"
  input: "input_layer/SepalWidth/Reshape"
  input: "input_layer/concat/axis"
  attr {
    key: "N"
    value {
      i: 4
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "init"
  op: "NoOp"
